<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [2]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [3]:
# текст запроса
query_3_1 = f'''
select count(*) cnt_vacancies
from VACANCIES
'''

In [31]:
# результат запроса
cnt_vacancies = pd.read_sql_query(query_3_1, connection)
cnt_vacancies

C:\Users\user\AppData\Local\Temp\ipykernel_4620\171045517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cnt_vacancies = pd.read_sql_query(query_3_1, connection)

   cnt_vacancies
0          49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [4]:
# текст запроса
query_3_2 = f'''
select count(*) cnt_employers
from employers
'''

In [5]:
# результат запроса
cnt_employers = pd.read_sql_query(query_3_2, connection)
cnt_employers

C:\Users\user\AppData\Local\Temp\ipykernel_4620\1180384295.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cnt_employers = pd.read_sql_query(query_3_2, connection)

   cnt_employers
0          23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [6]:
# текст запроса
query_3_3 = f'''
select count(*) cnt_areas
from areas
'''

In [7]:
# результат запроса
cnt_areas = pd.read_sql_query(query_3_3, connection)
cnt_areas

C:\Users\user\AppData\Local\Temp\ipykernel_4620\1323052804.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cnt_areas = pd.read_sql_query(query_3_3, connection)

   cnt_areas
0       1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [8]:
# текст запроса
query_3_4 = f'''
select count(*) cnt_industries
from industries
'''

In [9]:
# результат запроса
cnt_industries = pd.read_sql_query(query_3_4, connection)
cnt_industries

C:\Users\user\AppData\Local\Temp\ipykernel_4620\1736689219.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  cnt_industries = pd.read_sql_query(query_3_4, connection)

   cnt_industries
0             294

***

In [ ]:
# выводы по предварительному анализу данных
При проведении предварительного анализа данных была изучена общая структура базы данных, с которой будет проводиться дальнейшая работа.

База данных содержит информацию о 49197 открытых вакансиях. В базе содержится информация о 23501 работодателях, которые задействованы в 294 сферах деятельности и в 1362 регионов.

Можно сделать вывод, что перед нами достаточно общирная база данных, анализ которой дает возможность выявить существующие закономерности и сделать выводы относительно состояния рынка вакансий.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Выберите пятёрку лидеров по количеству вакансий.

In [32]:
# текст запроса
query_4_1 = f'''
SELECT areas.name, COUNT(vacancies.id) AS vacancy_count
FROM areas
JOIN vacancies ON areas.id = vacancies.area_id
GROUP BY areas.name
ORDER BY vacancy_count DESC
LIMIT 5;
'''

In [33]:
# результат запроса
vacancy_count = pd.read_sql_query(query_4_1, connection)
vacancy_count

C:\Users\user\AppData\Local\Temp\ipykernel_4620\1069493736.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vacancy_count = pd.read_sql_query(query_4_1, connection)

              name  vacancy_count
0           Москва           5333
1  Санкт-Петербург           2851
2            Минск           2112
3      Новосибирск           2006
4           Алматы           1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [34]:
# текст запроса
query_4_2 = f'''
SELECT COUNT(*) AS vacancies_count
FROM vacancies
WHERE salary_from IS NOT NULL OR salary_to IS NOT NULL
'''

In [35]:
# результат запроса
vacancies_count = pd.read_sql_query(query_4_2, connection)
vacancies_count

C:\Users\user\AppData\Local\Temp\ipykernel_4620\3779419093.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vacancies_count = pd.read_sql_query(query_4_2, connection)

   vacancies_count
0            24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [36]:
# текст запроса
query_4_3 = f'''
SELECT ROUND(AVG(salary_from)) AS avg_salary_from, ROUND(AVG(salary_to)) AS avg_salary_to
FROM vacancies    
'''

In [37]:
# результат запроса
avg_salary = pd.read_sql_query(query_4_3, connection)
avg_salary

C:\Users\user\AppData\Local\Temp\ipykernel_4620\212845365.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  avg_salary = pd.read_sql_query(query_4_3, connection)

   avg_salary_from  avg_salary_to
0          71065.0       110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [38]:
# текст запроса
query_4_4 = f'''
SELECT schedule, employment, COUNT(*) AS vacancy_count
FROM vacancies
GROUP BY schedule, employment
ORDER BY vacancy_count DESC
'''

In [39]:
# результат запроса
vacancy_count = pd.read_sql_query(query_4_4, connection)
vacancy_count

C:\Users\user\AppData\Local\Temp\ipykernel_4620\836230246.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vacancy_count = pd.read_sql_query(query_4_4, connection)

            schedule           employment  vacancy_count
0        Полный день     Полная занятость          35367
1   Удаленная работа     Полная занятость           7802
2      Гибкий график     Полная занятость           1593
3   Удаленная работа  Частичная занятость           1312
4     Сменный график     Полная занятость            940
5        Полный день           Стажировка            569
6     Вахтовый метод     Полная занятость            367
7        Полный день  Частичная занятость            347
8      Гибкий график  Частичная занятость            312
9        Полный день     Проектная работа            141
10  Удаленная работа     Проектная работа            133
11     Гибкий график           Стажировка            116
12    Сменный график  Частичная занятость            101
13  Удаленная работа           Стажировка             64
14     Гибкий график     Проектная работа             18
15    Сменный график           Стажировка             12
16    Вахтовый метод     Проектная работа              2
17    Сменный график     Проектная работа              1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [40]:
# текст запроса
query_4_5 = f'''
SELECT experience, COUNT(*) AS vacancy_count
FROM vacancies
GROUP BY experience
ORDER BY vacancy_count ASC
'''

In [41]:
# результат запроса
vacancy_count = pd.read_sql_query(query_4_5, connection)
vacancy_count

C:\Users\user\AppData\Local\Temp\ipykernel_4620\3959331939.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vacancy_count = pd.read_sql_query(query_4_5, connection)

           experience  vacancy_count
0         Более 6 лет           1337
1           Нет опыта           7197
2       От 3 до 6 лет          14511
3  От 1 года до 3 лет          26152

***

In [ ]:
# выводы по детальному анализу вакансий
Большая часть вакансий (5333) приходится на Москву, на топ-5 регионов приходится 14194 вакансии, что составляет около 29% из общего числа вакансий. Таким образом, обнаружена существенная концентрация рынка труда в Москве, с отставанием остальных регионов.
Почти половина вакансий в базе содержит сведения о заработной плате (24073 вакансии - около 49% от общего числа). Около 71% (35367) из общего числа открытых вакансий приходится на вакансии, которые подразумевают полную занятость на полный рабочий день. Соискатели, которые заинтересованы в удаленной работе на полный день, имеют меньшую возможность трудоустройства, т.к. таких вакансий всего лишь 7802, что составляет около 16% вакансий.
В основном компании размещают вакансии для специалистов с небольшим опытом (от 1 года до 3 лет) - 26152 вакансий приходится именно на такой опыт работы. Меньше всего вакансий - 1337 открыто для опытных соискателей (с опытом более 6 лет).

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [42]:
# текст запроса
query_5_1 = f'''
select e.name, count(v.id) count_vacancies
from VACANCIES v
left join EMPLOYERS e on v.employer_id = e.id
group by employer_id, e.name
order by count(v.id) desc
limit 5
'''

In [43]:
# результат запроса
count_vacancies = pd.read_sql_query(query_5_1, connection)
count_vacancies

C:\Users\user\AppData\Local\Temp\ipykernel_4620\1709258136.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  count_vacancies = pd.read_sql_query(query_5_1, connection)

            name  count_vacancies
0         Яндекс             1933
1     Ростелеком              491
2       Тинькофф              444
3           СБЕР              428
4  Газпром нефть              331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [48]:
# текст запроса
query_5_2 = f'''
select a.id, a.name, vac.count_vac, emp.count_emp  
from areas a
left join 
(select 
v.area_id vac_area_id,
count(v.id) count_vac
from VACANCIES v 
group by v.area_id) vac          
on a.id = vac.vac_area_id 
left join 
(select 
e.area emp_area_id,
count(e.id) count_emp
from employers e 
group by e.area) emp          
on a.id = emp.emp_area_id
where  emp.count_emp is not null
order by vac.count_vac desc, emp.count_emp desc
'''

In [49]:
# результат запроса
count_vacancies = pd.read_sql_query(query_5_2, connection)
count_vacancies

C:\Users\user\AppData\Local\Temp\ipykernel_4620\865207738.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  count_vacancies = pd.read_sql_query(query_5_2, connection)

       id                name  count_vac  count_emp
0     113              Россия        NaN        410
1      40           Казахстан        NaN        207
2    2019  Московская область        NaN         75
3    1438  Краснодарский край        NaN         19
4    1530  Ростовская область        NaN         18
..    ...                 ...        ...        ...
649  2048         Электроугли        1.0          1
650  1443         Белореченск        1.0          1
651  1542       Красный Сулин        1.0          1
652  1689            Заволжье        1.0          1
653  2057       Ликино-Дулево        1.0          1

[654 rows x 4 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [50]:
# текст запроса
query_5_3 = f'''
select e.name, count(distinct v.area_id) cnt_area
from VACANCIES v
left join EMPLOYERS e on v.employer_id = e.id
group by employer_id, e.name
order by count(distinct v.area_id) desc
'''

In [52]:
# результат запроса
employers_in_area = pd.read_sql_query(query_5_3, connection)
employers_in_area

C:\Users\user\AppData\Local\Temp\ipykernel_4620\3101763236.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employers_in_area = pd.read_sql_query(query_5_3, connection)

                                         name  cnt_area
0                                      Яндекс       181
1                                  Ростелеком       152
2                                  Спецремонт       116
3                      Поляков Денис Иванович        88
4                                   ООО ЕФИН         71
...                                       ...       ...
14901                            НПП Авиатрон         1
14902              Центр дистанционных торгов         1
14903  Городские Телекоммуникационные Системы         1
14904                       Введенский, Отель         1
14905              Группа Компаний Автоимпорт         1

[14906 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [53]:
# текст запроса
query_5_4 = f'''
SELECT COUNT(*) 
FROM employers 
LEFT JOIN employers_industries ON employers.id = employers_industries.employer_id 
WHERE employers_industries.employer_id IS NULL
'''

In [54]:
# результат запроса
count = pd.read_sql_query(query_5_4, connection)
count

C:\Users\user\AppData\Local\Temp\ipykernel_4620\216756390.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  count = pd.read_sql_query(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [55]:
# текст запроса
query_5_5 = f'''
SELECT employers.name
FROM employers
JOIN employers_industries ON employers.id = employers_industries.employer_id
GROUP BY employers.name
HAVING COUNT(employers_industries.industry_id) = 4
ORDER BY employers.name
LIMIT 1 OFFSET 2
'''

In [56]:
# результат запроса
name = pd.read_sql_query(query_5_5, connection)
name

C:\Users\user\AppData\Local\Temp\ipykernel_4620\765199497.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  name = pd.read_sql_query(query_5_5, connection)

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [57]:
# текст запроса
query_5_6 = f'''
SELECT COUNT(*) 
FROM employers 
JOIN employers_industries ON employers.id = employers_industries.employer_id 
JOIN industries ON industries.id = employers_industries.industry_id 
WHERE industries.name = 'Разработка программного обеспечения'
'''

In [58]:
# результат запроса
count = pd.read_sql_query(query_5_6, connection)
count

C:\Users\user\AppData\Local\Temp\ipykernel_4620\1411743808.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  count = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [63]:
# текст запроса
query_5_7 = f'''
SELECT areas.name, COUNT(vacancies.id) AS vacancy_count
FROM areas
JOIN vacancies ON areas.id = vacancies.area_id
JOIN employers ON vacancies.employer_id = employers.id
WHERE employers.name = 'Яндекс' and areas.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург','Казань', 'Нижний Новгород','Красноярск', 'Челябинск','Самара', 'Уфа','Ростов-на-Дону', 'Краснодар','Омск', 'Воронеж','Пермь', 'Волгоград')
GROUP BY areas.name
ORDER BY vacancy_count DESC
'''

In [64]:
# результат запроса
vacancy_count = pd.read_sql_query(query_5_7, connection)
vacancy_count

C:\Users\user\AppData\Local\Temp\ipykernel_4620\37837988.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vacancy_count = pd.read_sql_query(query_5_7, connection)

               name  vacancy_count
0            Москва             54
1   Санкт-Петербург             42
2      Екатеринбург             39
3   Нижний Новгород             36
4       Новосибирск             35
5           Воронеж             32
6         Краснодар             30
7            Самара             26
8               Уфа             26
9            Казань             25
10            Пермь             25
11   Ростов-на-Дону             25
12        Волгоград             24
13       Красноярск             23
14        Челябинск             22
15             Омск             21

***

In [ ]:
# выводы по анализу работодателей
В рамках анализа работодателей мы выяснили, что компания Яндекс является топ-1 работодателей по числу вакансий (1933 шт) и охвату территорий, где представлены вакансии (181 регион). Из прочих крупных компаний с большим количеством вакансий (Ростелеком, Тинькофф, Сбер, Газпром нефть), только Ростелеком имеет существенный охват регионов - 151 регион, остальные в список не попали, что указывает на специфичность каждой отрасли, так Банки (Тинькофф и Сбер), а также добывающие компании (Газпром нефть) ввиду своих особенностей имеют более высокую концентрацию в регионе размещения головного офиса/производства.

25% от всех вакансий компании Яндекс (485 шт.) опубликованы в городах-миллионниках, где лидирует Москва и Санкт-Петербург. Минимальное количество вакансий Яндекса в городах-миллионниках в Омске (21 шт) - максимальное в Москве (54 шт).

35% от всех работодателей не внесли информацию о сфере их деятельности (8419 компании).

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [4]:
# текст запроса
query_6_1 = f'''
SELECT COUNT(*) 
FROM vacancies 
WHERE LOWER(name) LIKE '%data%' OR LOWER(name) LIKE '%данн%'
'''

In [5]:
# результат запроса
count = pd.read_sql_query(query_6_1, connection)
count

C:\Users\user\AppData\Local\Temp\ipykernel_1372\1497578840.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  count = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [6]:
# текст запроса
query_6_2 = f'''
SELECT COUNT(*) 
FROM vacancies 
WHERE 
(name ILIKE '%data scientist%' 
OR name ILIKE '%data science%' 
OR name ILIKE '%исследователь данных%' 
OR name ILIKE '%machine learning%' 
OR (name ILIKE '%ML%' and name not ILIKE '%HTML%')
OR name ILIKE '%машинн%обучен%') 
AND 
(name ILIKE '%junior%' 
OR experience ILIKE '%нет опыта%' 
OR employment ILIKE '%стажировка%')
'''

In [7]:
# результат запроса
count = pd.read_sql_query(query_6_2, connection)
count

C:\Users\user\AppData\Local\Temp\ipykernel_1372\671929305.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  count = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [8]:
# текст запроса
query_6_3 = f'''
SELECT COUNT(*) 
FROM vacancies 
WHERE 
(key_skills ILIKE '%SQL%' 
OR key_skills ILIKE '%postgres%')
AND 
(name ILIKE '%data scientist%' 
OR name ILIKE '%data science%' 
OR name ILIKE '%исследователь данных%' 
OR name ILIKE '%machine learning%' 
OR (name LIKE '%ML%' and name not ILIKE '%HTML%')
OR name ILIKE '%машинн%обучен%') 
'''

In [9]:
# результат запроса
count = pd.read_sql_query(query_6_3, connection)
count

C:\Users\user\AppData\Local\Temp\ipykernel_1372\3723735131.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  count = pd.read_sql_query(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [10]:
# текст запроса
query_6_4 = f'''
SELECT COUNT(*) 
FROM vacancies 
WHERE 
key_skills ILIKE '%Python%' 
AND 
(name ILIKE '%data scientist%' 
OR name ILIKE '%data science%' 
OR name ILIKE '%исследователь данных%' 
OR name ILIKE '%machine learning%' 
OR (name LIKE '%ML%' and name not ILIKE '%HTML%')
OR name ILIKE '%машинн%обучен%') 
'''

In [11]:
# результат запроса
count = pd.read_sql_query(query_6_4, connection)
count

C:\Users\user\AppData\Local\Temp\ipykernel_1372\3363866734.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  count = pd.read_sql_query(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [12]:
# текст запроса
query_6_5 = f'''
SELECT ROUND(AVG(length(key_skills) - length(replace(key_skills, CHR(9), '')) + 1),2)
FROM vacancies
WHERE
name ILIKE '%data scientist%'
OR name ILIKE '%data science%'
OR name ILIKE '%исследователь данных%'
OR name ILIKE '%machine learning%'
OR (name LIKE '%ML%' AND name NOT ILIKE '%HTML%')
OR name ILIKE '%машинн%обучен%'
AND key_skills IS NOT NULL
'''

In [13]:
# результат запроса
count = pd.read_sql_query(query_6_5, connection)
count

C:\Users\user\AppData\Local\Temp\ipykernel_1372\262615926.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  count = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [14]:
# текст запроса
query_6_6 = f'''
SELECT ROUND(AVG(coalesce((salary_from + salary_to)/2, salary_from, salary_to))) AS average_salary
FROM vacancies
WHERE (name ILIKE '%data scientist%'
OR name ILIKE '%data science%'
OR name ILIKE '%исследователь данных%'
OR name ILIKE '%machine learning%'
OR (name LIKE '%ML%' AND name NOT ILIKE '%HTML%')
OR name ILIKE '%машинн%обучен%')
AND experience ILIKE 'От 3 до 6 лет'
AND (salary_from IS NOT NULL OR salary_to IS NOT NULL)
'''

In [15]:
# результат запроса
avg = pd.read_sql_query(query_6_6, connection)
avg

C:\Users\user\AppData\Local\Temp\ipykernel_1372\2569626805.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  avg = pd.read_sql_query(query_6_6, connection)

   average_salary
0        243115.0

***

In [ ]:
# выводы по предметному анализу
Доля вакансий, которые имеют отношение к данным, мала в общем объеме - это 3.6% (или 1771 шт). Вакансий для начинающих дата-сайентистов всего 51 шт. При этом стоит обратить внимание на ключевые навыки, которыми должен обладать соискатель, заинтересованные в трудоустройстве в качестве дата-саентиста: знание Python указано в 351 вакансии, SQL - в 201 вакансии.

Однако, несмотря на тот факт, что вакансий для дата-саентистов мало на рынке, все предложенные вакансии с информацией о заработной плате имеют среднюю заработную плату выше чем, средняя заработная плата по всем вакансиям, что объясняет привлекательность данной сферы для соискателей.

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
Для исследования предоставлена общирная база данных, которая содержит сведения о 49197 открытых вакансиях, 23501 работодателях, которые заняты в 294 возможных сферах деятельности. База вакансий покрывает 1362 различных региона. При этом 10,8% от общего числа открытых вакансий (5333 вакансии) приходятся на Москву, на топ-10 регионов приходится 43.5% из общего числа вакансий. Таким образом, можно судить о высокой положительной корреляции количества открытых вакансий и размеров городов, и существенной концентрации рынка труда в Москве и отставанием других крупных городов.

Большинство вакансий, находящихся в базе данных для специалистов с небольшим опытом (1-3 года) - 26152 вакансий приходится именно на такой опыт работы. Меньше всего вакансий - 1337 открыто для опытных соискателей (более 6 лет опыта). Почти половина вакансий в базе содержит сведения о заработной плате (24073 вакансии - 48,9% от общего числа). По итогам проведенного анализа вакансий для специалистов в дата-саейнс можно сделать следующие выводы: это высокооплачиваемая работа (зп почти в 2 раза выше средних по рынку), но достаточно редкая специализация, характерная для крупных IT-компаний, банков , телекоммуникационных компаний. При этом работодатели заинтересованы в кандидатах со средним уровнем опыта, вакансий для junior позиций данного направления мало. 

connection.close()